========
Empty {}
========

{}

---

(source_file
  (expr_term_braces))

======
Idents
======

[
  CamelCase1337,
  snake_case,
  __internal_snake_case,
  SCREAMING_SNAKE_CASE,
  kebap-case,
]

---

(source_file
  (expr_term_brackets
    (seq_elem
      (ident))
    (seq_elem
      (ident))
    (seq_elem
      (ident))
    (seq_elem
      (ident))
    (seq_elem
      (ident))))

==========
Call empty
==========

f()

---

(source_file
  (expr_call
    (ident)))

===================
Call trailing comma
===================

f("x",)

---

(source_file
  (expr_call
    (ident)
    (string)))

======================
Call no trailing comma
======================

f("x", y)

---

(source_file
  (expr_call
    (ident)
    (string)
    (ident)))

=====
Index
=====

collection["index"]

---

(source_file
  (expr_index
    (ident)
    (string)))
