=====
Empty
=====

""

---

(source_file (string (string_double)))

=====
Basic
=====

"foobar"

---

(source_file (string (string_double)))

========================
Escape unicode no braces
========================

"foo\u001abar"

---

(source_file (string (string_double (string_escape))))

=====================
Escape unicode braces
=====================

"foo\u{1f574}bar"

---

(source_file (string (string_double (string_escape))))

============
Escape quote
============

"foo\"bar"

---

(source_file (string (string_double (string_escape))))

=============
Triple quoted
=============

"""
Foo "bar"
""Two doesn't end the string""
Escaped \""" does not either.
But three does:
"""

---

(source_file (string (string_triple (string_escape))))
